# CannotCopyMustBeUniqueWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyMustBeUniqueWarn Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Element must be unique.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyMustBeUniqueWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyMustBeUniqueWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyMustBeUniqueWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace